Revit 2025 API
PlanViewRangeLevel Enumeration
 An enumerated type representing the options for setting the range for a plan view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PlanViewRangeLevel
Public Enumeration PlanViewRangeLevel
public enum class PlanViewRangeLevel
type PlanViewRangeLevel
Members
Member name | Value | Description
Unlimited | -1 |  View range is unlimited
Above | -2 |  View range is the level above
Current | -3 |  View range is the current level
Below | -4 |  View range is the level below
Unused | -5
See Also
Reference
Autodesk.Revit.DB Namespace